In [1]:
import pandas as pd

In [2]:
data=pd.read_csv(r'/Users/akbare/Downloads/Untitled spreadsheet - Sheet1-2.csv')

In [3]:
data

,TransactionID,ClientID,Profession,Bank_dep,Risk,Number of credits,Revenue
0,1,231,Self-employed,9,High,2,30200
1,2,765,students,5,High,3,12700
2,3,453,Horeca,7,Medium,5,89400
3,4,231,Self-employed,9,High,2,30200
4,5,892,finance,3,Low,3,740000

In [4]:
data.corr()

,TransactionID,ClientID,Bank_dep,Number of credits,Revenue
TransactionID,1.000000,0.409782,-0.485071,0.129099,0.723380
ClientID,0.409782,1.000000,-0.991723,0.298081,0.680580
Bank_dep,-0.485071,-0.991723,1.000000,-0.313112,-0.764117
Number of credits,0.129099,0.298081,-0.313112,1.000000,0.076941
Revenue,0.723380,0.680580,-0.764117,0.076941,1.000000

In [5]:
data.dtypes

TransactionID         int64
ClientID              int64
Profession           object
Bank_dep              int64
Risk                 object
Number of credits     int64
Revenue               int64
dtype: object

In [6]:
data.shape

(5, 7)

In [7]:
data.isna().sum()

TransactionID        0
ClientID             0
Profession           0
Bank_dep             0
Risk                 0
Number of credits    0
Revenue              0
dtype: int64

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   TransactionID      5 non-null      int64
 1   ClientID           5 non-null      int64
 2   Profession         5 non-null      object
 3   Bank_dep           5 non-null      int64
 4   Risk               5 non-null      object
 5   Number of credits  5 non-null      int64
 6   Revenue            5 non-null      int64
dtypes: int64(5), object(2)
memory usage: 408.0+ bytes

In [18]:
data.columns

Index(['TransactionID', 'ClientID', 'Profession', 'Bank_dep', 'Risk',
       'Number of credits', 'Revenue '],
      dtype='object')

In [19]:
data['Revenue '].mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0     30200
1     12700
2     89400
3     30200
4    740000
Name: Revenue , dtype: int64>

In [20]:
data.describe()

       TransactionID    ClientID  Bank_dep  Number of credits       Revenue
count       5.000000    5.000000  5.000000           5.000000       5.000000
mean        3.000000  514.400000  6.600000           3.000000  180500.000000
std         1.581139  304.049009  2.607681           1.224745  314116.411542
min         1.000000  231.000000  3.000000           2.000000   12700.000000
25%         2.000000  231.000000  5.000000           2.000000   30200.000000
50%         3.000000  453.000000  7.000000           3.000000   30200.000000
75%         4.000000  765.000000  9.000000           3.000000   89400.000000
max         5.000000  892.000000  9.000000           5.000000  740000.000000